//
//  Answer.swift
//  Qna
//
//  Created by 黃昌齊 on 2021/4/6.
//

import Foundation

struct Answer {
    let answer = [
        "A" : "無論身在何處，你給人的第一印象是很有氣勢、有份量的人。當然這種份量不是指重量，而是人格、個性上的。第一次跟你見面的人總是會不自覺的有種壓迫感，感覺低你一等，雖然你的地位跟能力的確很優秀，但是卻很容易被人家視為可怕、難以親近的人。有時在面人面前適度展現自己的放鬆的一面其實也是可以的。",
        "B" : "B型人就像有小太陽照耀著你一般，無論何時總是開朗有趣、溫柔隨和的一個人。你在長輩之中很受寵愛，和同事也能親近的相處，也很受後輩們的信任，可以說是很圓滿的性格。不過你的性格上的優點比較難被異性看見，因為太過溫和、缺少激情，也因此少了一點吸引力。",
        "C" : "總是不自覺的給人一種高冷、難以親近的感覺。雖然你常覺得自己的表情很普通平凡，但是在別人眼裡看起來卻會覺得有距離，甚至難相處。尤其是第一次跟你見面的人，總是會覺得很難直視你，你也會想著該對對方說什麼好呢？而且常常越想越焦慮、越是心急。想要脫離這樣的惡性循環，有時主動配合別人的相處模式也是一個好方法。",
        "D" : "你是一個能讓身邊的人很愉快，像太陽一樣散播歡樂的人，也因此當然會吸引很多人靠近你。充滿服務精神的你，只要有人尋求你的幫助，你就無法拒絕對方，也因為這樣的性格，偶爾會給你帶來疲憊感。但你也是一個平凡人，在你覺得辛苦的時候不要勉強，請學習依賴身邊的人吧！",
        "E" : "雖然很多科學界都在研究人類，但至今還難以找到答案。大概你自己也認為自己有這樣摸不透的部分，所以別人看見你的第一印象也是這樣想的。你是一個不喜歡被別人說像誰誰誰的人，雖然你有自己堅持想要的風格，但是你有時候對於自己在追求的東西也感到迷惘，是一個有點矛盾的人。"
    ]
}
